Конфигурация/Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ФискальныйЧек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФискальныйЧек</Name>
			<BasedOn>
				<xr:Item>Document.ЧекККМ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыФискализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ЧекККМ/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// --- 1. ИНИЦИАЛИЗАЦИЯ ДВИЖЕНИЙ ---
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Движения.ДенежныеСредства.Записывать = Истина;
	// Если используете дисконтные карты, раскомментируйте:
	// Движения.ПродажиПоДисконтнымКартам.Записывать = Истина;
	
	// --- 2. ПОЛУЧЕНИЕ ЗАКУПОЧНЫХ ЦЕН ДЛЯ СЕБЕСТОИМОСТИ ---
	СоответствиеСебестоимости = ПолучитьЗакупочныеЦены(Дата);
	
	// --- 3. ФОРМИРОВАНИЕ ДВИЖЕНИЙ ПО ТОВАРАМ ---
	Для Каждого ТекСтрока Из Товары Цикл
		
		// А) Списание остатков (Расход)
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.Количество = ТекСтрока.Количество;
		
		// Б) Фиксация продаж (Оборот)
		ДвижениеПродажи = Движения.Продажи.Добавить();
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Номенклатура = ТекСтрока.Номенклатура;
		ДвижениеПродажи.Касса = Касса;
		ДвижениеПродажи.КассоваяСмена = КассоваяСмена;
		// Пытаемся определить текущего пользователя как сотрудника
		ДвижениеПродажи.Сотрудник = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
		ДвижениеПродажи.Количество = ТекСтрока.Количество;
		ДвижениеПродажи.Сумма = ТекСтрока.Сумма;
		ЗакупочнаяЦена = СоответствиеСебестоимости.Получить(ТекСтрока.Номенклатура);
		Если ЗакупочнаяЦена <> Неопределено Тогда
			ДвижениеПродажи.Себестоимость = ТекСтрока.Количество * ЗакупочнаяЦена;
		КонецЕсли;
		
	КонецЦикла;
	
	// --- 4. ФОРМИРОВАНИЕ ДВИЖЕНИЙ ПО ДЕНЬГАМ ---
	Для Каждого ТекОплата Из Оплата Цикл
		ДвижениеДеньги = Движения.ДенежныеСредства.Добавить();
		ДвижениеДеньги.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеДеньги.Период = Дата;
		// Используем кассу из строки оплаты (выбранную при закрытии чека)
		// Если КассаОплаты не заполнена — используем кассу из шапки (обратная совместимость)
		Если ЗначениеЗаполнено(ТекОплата.КассаОплаты) Тогда
			ДвижениеДеньги.Касса = ТекОплата.КассаОплаты;
		Иначе
			ДвижениеДеньги.Касса = Касса;
		КонецЕсли;
		ДвижениеДеньги.Сумма = ТекОплата.Сумма;
	КонецЦикла;
	
	// --- 5. ЗАПУСК СПЛИТ-СИСТЕМЫ (ФИСКАЛИЗАЦИЯ) ---
	// Фискализация выполняется только для чеков со статусом "Пробит"
	// В нефискальном режиме (статус "Нефискальный") создаются только движения без печати фискального чека
	Если Не Отказ И Статус = Перечисления.СтатусыЧекаККМ.Пробит Тогда
		Попытка
			ВыполнитьФискализацию();
		Исключение
			// Если ошибка фискализации - отменяем проведение всего чека
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка фискализации: " + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

// --- ФИСКАЛИЗАЦИЯ ЧЕКА ---
// Одна касса = один РРО/ПРРО (указан в карточке кассы).
// Создаётся ОДИН ФискальныйЧек на весь ЧекККМ.
Процедура ВыполнитьФискализацию()
	
	// 1. Получаем оборудование (РРО/ПРРО) из карточки кассы
	Оборудование = ПолучитьОборудованиеКассы();
	
	Если Не ЗначениеЗаполнено(Оборудование) Тогда
		ВызватьИсключение "В карточке кассы """ + Касса + """ не указано оборудование (РРО/ПРРО). Заполните реквизит ""Оборудование"" в справочнике Кассы.";
	КонецЕсли;
	
	// 2. Создаём единый фискальный чек
	НовыйЧек = Документы.ФискальныйЧек.СоздатьДокумент();
	НовыйЧек.Дата = Дата;
	НовыйЧек.ДокументОснование = Ссылка;
	НовыйЧек.Оборудование = Оборудование;
	
	// Эмуляция ответа от драйвера (Номер чека и ФПД)
	УИД = Строка(Новый УникальныйИдентификатор);
	НовыйЧек.НомерЧекаККМ = "K-" + Сред(УИД, 1, 8);
	НовыйЧек.ФискальныйНомер = "FN-" + Сред(УИД, 25, 12);
	
	// 3. Переносим ВСЕ товары из ЧекККМ в ФискальныйЧек
	СуммаЧека = 0;
	Для Каждого СтрокаТЧ Из Товары Цикл
		НоваяСтрока = НовыйЧек.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		СуммаЧека = СуммаЧека + НоваяСтрока.Сумма;
	КонецЦикла;
	
	НовыйЧек.Сумма = СуммаЧека;
	
	// 4. Проводим фискальный чек
	НовыйЧек.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

// --- ПОЛУЧЕНИЕ ЗАКУПОЧНЫХ ЦЕН ДЛЯ РАСЧЁТА СЕБЕСТОИМОСТИ ---
Функция ПолучитьЗакупочныеЦены(ДатаДокумента)
	
	ТипЦенЗакупочная = Справочники.ТипыЦен.НайтиПоНаименованию("Закупочная");
	Если Не ЗначениеЗаполнено(ТипЦенЗакупочная) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для Каждого ТекСтрока Из Товары Цикл
		Если МассивНоменклатуры.Найти(ТекСтрока.Номенклатура) = Неопределено Тогда
			МассивНоменклатуры.Добавить(ТекСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныСрез.Номенклатура КАК Номенклатура,
		|	ЦеныСрез.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|		&ДатаДокумента,
		|		ТипЦен = &ТипЦен
		|			И Номенклатура В (&МассивНоменклатуры)) КАК ЦеныСрез";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦенЗакупочная);
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Номенклатура, Выборка.Цена);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// --- ПОЛУЧЕНИЕ ОБОРУДОВАНИЯ ИЗ КАРТОЧКИ КАССЫ ---
Функция ПолучитьОборудованиеКассы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кассы.Оборудование КАК Оборудование
		|ИЗ
		|	Справочник.Кассы КАК Кассы
		|ГДЕ
		|	Кассы.Ссылка = &Касса";
		
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Оборудование;
	КонецЕсли;
	
	Возврат Справочники.КассовоеОборудование.ПустаяСсылка();
	
КонецФункции
